# RebarBendData Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData Constructor
RebarBendData Class See Also
---
Constructs a new RebarBendData with default settings.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarBendData()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RebarBendData()
```

# See Also
RebarBendData Class
RebarBendData Overload
Autodesk.Revit.DB.Structure Namespace